
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	ТекДата.Сумма = ТекДата.Количество * ТекДата.Цена;
EndProcedure

&AtClient
Procedure ТоварыСуммаOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	Если ТекДата.Количество = 0 Тогда
		ТекДата.Цена = 0;
	Иначе
		ТекДата.Цена = ТекДата.Сумма / ТекДата.Количество;
	КонецЕсли;
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	ТекДата.Сумма = ТекДата.Количество * ТекДата.Цена;
EndProcedure

